code/sfs/unfolded/vcf-merge_instructions.tex
% Created 2023-06-19 Mo 16:43
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Philip L. Wolper}
\date{\today}
\title{Polarizing a vcf with an outgroup sequence.}
\hypersetup{
 pdfauthor={Philip L. Wolper},
 pdftitle={Polarizing a vcf with an outgroup sequence.},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.6.1)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{P.reichenowi variant call}
\label{sec:org5bbf1d7}
To generate a VCF file between the Pf7 reference genome and a single sample from P. reichenowi, you would need the following:

\begin{enumerate}
\item Pf7 reference genome FASTA file: This contains the Pf7 reference genome sequence.
\item P. reichenowi sample FASTA file: This contains the assembled genome sequence for the P. reichenowi sample.
\item GFF3 file: This contains the genomic annotations (gene locations, exons, etc.) for the Pf7 reference genome.
\end{enumerate}

Here's a step-by-step guide to generating the VCF file using `bcftools`:

\begin{enumerate}
\item Index the reference genome:
\begin{verbatim}

   bcftools faidx Pf7_reference.fasta

\end{verbatim}

\item Map P. reichenowi sample to the Pf7 reference genome:
\begin{verbatim}
   bwa index Pf7_reference.fasta
   bwa mem -t <num_threads> Pf7_reference.fasta P_reichenowi_sample.fasta | samtools sort -O BAM -o P_reichenowi_sample.bam
   samtools index P_reichenowi_sample.bam
\end{verbatim}

\item Generate the pileup file:
\end{enumerate}
\begin{verbatim}
      bcftools mpileup -f Pf7_reference.fasta P_reichenowi_sample.bam -o P_reichenowi_sample.bcf
\end{verbatim}

\begin{enumerate}
\item Call variants and generate the VCF file:
\end{enumerate}
\begin{verbatim}
   bcftools call -mv -Ov -o P_reichenowi_sample.vcf P_reichenowi_sample.bcf
\end{verbatim}


At this point, you should have the VCF file `P\textsubscript{reichenowi}\textsubscript{sample.vcf}` containing the variants between Pf7 and the P. reichenowi sample. You can then use this VCF file for downstream analysis or merge it with other samples as required.

\section{Merging the two vcf files}
\label{sec:orgfa39da3}
\begin{enumerate}
\item Merge VCF files: If you have separate VCF files for P. falciparum and P. reichenowi, you can merge them using `bcftools merge`. Assuming your P. falciparum VCF file is named ``pf.vcf'' and the P. reichenowi VCF file is named ``pr.vcf'', run the following command:
\end{enumerate}

\begin{verbatim}
   bcftools merge pf.vcf pr.vcf -Ov -o merged.vcf
\end{verbatim}

This command will merge the two VCF files into a single VCF file named ``merged.vcf''.

\begin{enumerate}
\item Update sample information: Now, use `bcftools reheader` to update the sample names in the merged VCF file. Suppose you have three P. falciparum samples (F1, F2, F3) and two P. reichenowi samples (R1, R2). Run the following command:
\end{enumerate}

\begin{verbatim}
   bcftools reheader -s F1,F2,F3,R1,R2 merged.vcf -o updated.vcf
\end{verbatim}

This command will update the sample names in the VCF file and create a new file named ``updated.vcf''.

\begin{enumerate}
\item Add genotype data: To add the genotype data for the P. reichenowi samples, use `bcftools annotate`. Assuming your P. reichenowi genotype data is in a separate VCF file named ``pr\textsubscript{genotypes.vcf}'', run the following command:
\end{enumerate}

\begin{verbatim}
   bcftools annotate --annotations pr_genotypes.vcf --columns +FORMAT -Ov -o final.vcf updated.vcf
\end{verbatim}

This command will add the genotype data from ``pr\textsubscript{genotypes.vcf}'' to the ``updated.vcf'' file and create a new file named ``final.vcf''.

\begin{enumerate}
\item Validate and index the VCF file: Finally, validate the VCF file using `bcftools`, and index it for downstream analysis:
\end{enumerate}

\begin{verbatim}
   bcftools view final.vcf > validated.vcf
   bcftools index validated.vcf
\end{verbatim}

These commands will ensure that the VCF file is valid and create an index file named ``validated.vcf.csi'' for use with subsequent analysis tools.

Now you can proceed with polarizing the variants using the GitHub tool you mentioned and calculate the unfolded site frequency spectrum (SFS) using the ``validated.vcf'' file.
\end{document}